package ee.oyatl.ime.keyboard.layout

object LayoutZhuyin {

    val ROWS: List<String> = listOf(
        "ㄅㄉˇˋㄓˊ˙ㄚㄞㄢ",
        "ㄆㄊㄍㄐㄔㄗㄧㄛㄟㄣ",
        "ㄇㄋㄎㄑㄕㄘㄨㄜㄠㄤ",
        "ㄈㄌㄏㄒㄖㄙㄩㄝㄡㄥ",
        "ㄦ"
    )

    val CODES_MAP = mapOf(
        'ㄅ' to 12549,
        'ㄉ' to 12553,
        'ˇ' to 711,
        'ˋ' to 715,
        'ㄓ' to 12563,
        'ˊ' to 714,
        '˙' to 729,
        'ㄚ' to 12570,
        'ㄞ' to 12574,
        'ㄢ' to 12578,
        'ㄆ' to 12550,
        'ㄊ' to 12554,
        'ㄍ' to 12557,
        'ㄐ' to 12560,
        'ㄔ' to 12564,
        'ㄗ' to 12567,
        'ㄧ' to 12583,
        'ㄛ' to 12571,
        'ㄟ' to 12575,
        'ㄣ' to 12579,
        'ㄇ' to 12551,
        'ㄋ' to 12555,
        'ㄎ' to 12558,
        'ㄑ' to 12561,
        'ㄕ' to 12565,
        'ㄘ' to 12568,
        'ㄨ' to 12584,
        'ㄜ' to 12572,
        'ㄠ' to 12576,
        'ㄤ' to 12580,
        'ㄈ' to 12552,
        'ㄌ' to 12556,
        'ㄏ' to 12559,
        'ㄒ' to 12562,
        'ㄖ' to 12566,
        'ㄙ' to 12569,
        'ㄩ' to 12585,
        'ㄝ' to 12573,
        'ㄡ' to 12577,
        'ㄥ' to 12581,
        'ㄦ' to 12582
    )
}